from string import Template

#### RAG PROMPTS (Arabic) ####

#### SYSTEM ####
system_prompt_ar = Template(
    "\n".join([
        "أنت مساعد لتوليد رد للمستخدم.",
        "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
        "يجب أن تقوم بتوليد الرد بالاعتماد على المستندات المقدمة.",
        "تجاهل المستندات غير المرتبطة باستفسار المستخدم.",
        "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
        "يجب أن يكون الرد بنفس لغة استفسار المستخدم.",
        "كن مهذبًا ومحترمًا في ردك.",
        "كن دقيقًا ومختصرًا في الإجابة، وتجنب المعلومات غير الضرورية."
    ])
)

#### DOCUMENT ####
document_prompt_ar = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text"
    ])
)

#### FOOTER ####
footer_prompt_ar = Template(
    "\n".join([
        "بناءً فقط على المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
        "## السؤال",
        "$query",
        "",
        "## الإجابة"
    ])
)
